
public class Ex01_Object {
	public static void main(String[] args) {
/*
 * class와 method로 구성
 *  main메소드 : 가장 먼저 실행하는 부분
 *  클래스 : 틀
 *  메소드 : 클래스내에서의 기능, 처리에 대한 기능, 입력에 대한 기능
 *  변수 : 클래스내에서 사용할 값
 *  
 *  
 *  객체 : 물질적 추상적으로 존재하는 것 
 *  인스턴스 : 설계도를 바탕으로 구현된 대상
 *  클래스 : 설계도
 *  메소드 : 클래스 내의 기능을 구현
 *  필드, 변수 : 값을 저장
 *  생성자 : 클래스 생성자, 지정하지 않으면 디폴트 생성자가 자동으로 생성됨
 *  파라미터, 매개변수 : ? 매개변수, 
 *  인자, 아규먼트 : ?
 *  리턴(반환값) : 값을 반환하지 않으면 void, 
 *  http://www.tcpschool.com/java/java_class_intro
 * 
 * 
 */
	}
}
